/******************************************************************************
 *
 * 文件名  ： accel.c
 * 负责人  ： 彭鹏(pengpeng@fiberhome.com)
 * 创建日期： 20150825 
 * 版本号  ： v1.0
 * 文件描述： 加计的姿态解算
 * 版权说明： Copyright (c) 2000-2020 GNU
 * 其    他： 无
 * 修改日志： 无
 *
 *******************************************************************************/


/*---------------------------------- 预处理区 ---------------------------------*/

/************************************ 头文件 ***********************************/
#include "algo.h"
#include "port.h"
#include "attidude.h"
#include "algo_math.h"
#include "accel.h"

/*----------------------------------- 声明区 ----------------------------------*/

/********************************** 变量声明区 *********************************/


/********************************** 函数声明区 *********************************/

/********************************** 变量实现区 *********************************/


/********************************** 函数实现区 *********************************/
void *accel_loop(void *argv)
{
    float accel[ALGO_DIM] = {0.0f};

    while(1)
    {
        delay_ms(ALGO_ACCEL_PERIOD);
        ALGO_ACCEL_GET_DATA(accel);
        ALGO_ACCEL_FUSION(accel);
    }

    return NULL;
}

int accel_fusion(const float *accel)
{
    return 0;
}

