/******************************************************************************
 *
 * 文件名  ： imu.c
 * 负责人  ： 彭鹏(pengpeng@fiberhome.com)
 * 创建日期： 20150116 
 * 版本号  ： v1.0
 * 文件描述： 姿态融合算法
 * 版权说明： Copyright (c) 2000-2020 GNU
 * 其    他： 无
 * 修改日志： 无
 *
 *******************************************************************************/


/*---------------------------------- 预处理区 ---------------------------------*/

/************************************ 头文件 ***********************************/
#include <stdio.h>



/*----------------------------------- 声明区 ----------------------------------*/

/********************************** 变量声明区 *********************************/
static float s_quaternion[4] = {0.0f}; /* 四元数 w x y z*/
static float s_quaternion_lock; /* 四元数锁 */

/********************************** 函数声明区 *********************************/
static int quaternion_lock(void);
static int quaternion_unlock(void);

/********************************** 变量实现区 *********************************/


/********************************** 函数实现区 *********************************/
/*******************************************************************************
 *
 * 函数名  : imu_update
 * 负责人  : 彭鹏
 * 创建日期: 20150729
 * 函数功能: 短期融合
 *
 * 输入参数: gyro  陀螺仪输出
 * 输出参数: quaternion  四元数指针
 *
 * 返回值:   0   : 正常退出
 *           其它: 异常退出
 * 调用关系: 无
 * 其 它:    短期融合仅仅使用gyro输出的角速度积分获取当前姿态
 *
 ******************************************************************************/
int imu_update(float *quaternion, const float *gyro)
{
    return 0;
}

/*******************************************************************************
 *
 * 函数名  : fusion6axis
 * 负责人  : 彭鹏
 * 创建日期: 20150729
 * 函数功能: 6轴融合
 *
 * 输入参数: gyro  陀螺仪输出
 *           accel 加速度计输出
 *
 * 输出参数: quaternion  四元数
 *
 * 返回值:   0   : 正常退出
 *           其它: 异常退出
 * 调用关系: 无
 * 其 它:    6轴融合使用加速度计获取重力场修正陀螺仪积分误差(无法确定偏航角)
 *
 ******************************************************************************/
int fusion6axis(float *quaternion, const float *gyro, const float *accel)
{
    return 0;
}

/*******************************************************************************
 *
 * 函数名  : fusion9axis
 * 负责人  : 彭鹏
 * 创建日期: 20150729
 * 函数功能: 9轴融合
 *
 * 输入参数: gyro  陀螺仪输出
 *           accel 加速度计输出
 *           mag   磁力计输出
 *
 * 输出参数: quaternion  四元数指针
 *
 * 返回值:   0   : 正常退出
 *           其它: 异常退出
 * 调用关系: 无
 * 其 它:    9轴融合使用加速度计获取重力场、地磁场修正陀螺仪积分误差(可以纠正偏航角)
 *
 ******************************************************************************/
int fusion9axis(float *quaternion, const float *gyro, const float *accel, const float *mag)
{
    return 0;
}

/*******************************************************************************
 *
 * 函数名  : quaternion_lock
 * 负责人  : 彭鹏
 * 创建日期: 20150729
 * 函数功能: 锁定
 *
 * 输入参数: 无
 * 输出参数: 无
 *
 * 返回值:   0   : 正常退出
 *           其它: 异常退出
 * 调用关系: 无
 * 其 它:    可能会阻塞 避免获取四元数 时产生不一致
 *
 ******************************************************************************/
static int quaternion_lock(void)
{
    return 0;
}

/*******************************************************************************
 *
 * 函数名  : quaternion_lock
 * 负责人  : 彭鹏
 * 创建日期: 20150729
 * 函数功能: 解除锁定
 *
 * 输入参数: 无
 * 输出参数: 无
 *
 * 返回值:   0   : 正常退出
 *           其它: 异常退出
 * 调用关系: 无
 * 其 它:    与quaternion_lock成对使用
 *
 ******************************************************************************/
static int quaternion_unlock(void)
{
    return 0;
}

/*******************************************************************************
 *
 * 函数名  : get_attitude
 * 负责人  : 彭鹏
 * 创建日期: 20150729
 * 函数功能: 获取当前针对参考坐标系的姿态
 *           0 pitch 俯仰角
 *           1 roll  翻滚角
 *           2 yaw   偏航角
 *
 *           (pitch,roll,yaw)
 * 输入参数: 无
 * 输出参数: 无
 *
 * 返回值:   0   : 正常退出
 *           其它: 异常退出
 * 调用关系: 无
 * 其 它:    无
 *
 ******************************************************************************/
int get_attitude(float *attitude)
{
    return 0;
}

