/******************************************************************************
 *
 * 文件名  ： switch.h
 * 负责人  ： 彭鹏(pengpeng@fiberhome.com)
 * 创建日期： 20150410 
 * 版本号  ： v1.0
 * 文件描述： 线程调度实现
 * 版权说明： Copyright (c) 2000-2020 GNU
 * 其    他： 
 *            1. 算法描述 见switch.c文件
 *            2. 所有切换算法相关的变量全部定义(static)于本文件
 *            3. 其他模块(例如tcb_list.c)需要使用2中的变量本模块通过set/get函数导出
 * 修改日志： 无
 *
 *******************************************************************************/

/*---------------------------------- 预处理区 ---------------------------------*/
#ifndef _CM_SWITCH_H_
#define _CM_SWITCH_H_

/************************************ 头文件 ***********************************/
#include "typedef.h"

/************************************ 宏定义 ***********************************/

/*********************************** 类型定义 **********************************/


/*--------------------------------- 接口声明区 --------------------------------*/

/*********************************** 全局变量 **********************************/

/*********************************** 接口函数 **********************************/
/*******************************************************************************
 *
 * 函数名  : thread_switch
 * 负责人  : 彭鹏
 * 创建日期：20150331 
 * 函数功能: 线程切换
 *
 * 输入参数: 当前任务sp
 *
 * 输出参数: 无
 *
 * 返回值  : 准备运行任务的sp
 *          
 * 调用关系: 无
 * 其 它   : 无
 *
 ******************************************************************************/
void *thread_switch(const void *cur_stack);

void switch_update_timeslice(void);

static cm_tcb_t *switch_get_highest_tcb(void);

cm_tcb_t *switch_get_first_tcb(cm_priority_t priority);

void switch_init_first_tcb(cm_tcb_t *ptr_tcb);

#endif // #ifndef _CM_SWITCH_H_

