/******************************************************************************
 *
 * 文件名  ： mutex.h
 * 负责人  ： 彭鹏(pengpeng@fiberhome.com)
 * 创建日期： 20151127 
 * 版本号  ： v1.0
 * 文件描述： 互斥锁接口
 * 版权说明： Copyright (c) 2000-2020 GNU
 * 其    他： 无
 * 修改日志： 无
 *
 *******************************************************************************/

/*---------------------------------- 预处理区 ---------------------------------*/
#ifndef _CMOS_IPC_MUTEX_H_
#define _CMOS_IPC_MUTEX_H_

/************************************ 头文件 ***********************************/
#include "cmos_config.h"

/************************************ 宏定义 ***********************************/

/*********************************** 类型定义 **********************************/
typedef void* cmos_ipc_mutex_T;

/*--------------------------------- 接口声明区 --------------------------------*/

/*********************************** 全局变量 **********************************/

/*********************************** 接口函数 **********************************/
cmos_ipc_mutex_T *cmos_ipc_mutex_malloc(void);
cmos_status_T cmos_ipc_mutex_lock(cmos_ipc_mutex_T *mutex);
cmos_status_T cmos_ipc_mutex_unlock(cmos_ipc_mutex_T *mutex);
void cmos_ipc_mutex_free(cmos_ipc_mutex_T *mutex);

#endif /* #ifndef _CMOS_IPC_MUTEX_H_ */

