/******************************************************************************
 *
 * 文件名  ： mem.c
 * 负责人  ： 彭鹏(pengpeng@fiberhome.com)
 * 创建日期： 20150412 
 * 版本号  ： v1.0
 * 文件描述： 实现动态内存管理
 * 版权说明： Copyright (c) 2000-2020 GNU
 * 其    他： 无
 * 修改日志： 无
 *
 *******************************************************************************/


/*---------------------------------- 预处理区 ---------------------------------*/

/************************************ 头文件 ***********************************/
#include "typedef.h"
#include "mem.h"

/*----------------------------------- 声明区 ----------------------------------*/

/********************************** 变量声明区 *********************************/
/* heap_base <= heap_ptr < heap_limit */
cm_uint32_t s_heap_base = 0;
cm_uint32_t s_heap_limit = 0;

/********************************** 函数声明区 *********************************/
cm_uint32_t get_heap_base(void);
cm_uint32_t get_heap_limit(void);

/********************************** 变量实现区 *********************************/


/********************************** 函数实现区 *********************************/
void mem_init(void)
{
    s_heap_base = get_heap_base();
    s_heap_limit = get_heap_limit();
}

void *cm_malloc(cm_uint32_t size)
{
    return NULL;
}

void cm_free(void *ptr)
{
    return;
}
