/******************************************************************************
 *
 * 文件名  ： main.c
 * 负责人  ： 彭鹏(pengpeng@fiberhome.com)
 * 创建日期： 20150629 
 * 版本号  ： 1.0
 * 文件描述： MPU9250传感器 I2C读取
 * 版权说明： Copyright (c) GNU
 * 其    他： 无 
 * 修改日志： 无 
 *
 *******************************************************************************/

/*---------------------------------- 预处理区 ---------------------------------*/

/************************************ 头文件 ***********************************/
#include "cmos_config.h"
#include "cmos_api.h"
#include "mpu9250.h"

/*----------------------------------- 声明区 ----------------------------------*/

/********************************** 变量声明区 *********************************/
accel_T s_accel;
gyro_T s_gyro;
mag_T s_mag;

/********************************** 函数声明区 *********************************/

/********************************** 函数实现区 *********************************/
/*******************************************************************************
*
* 函数名  : main
* 负责人  : 彭鹏
* 创建日期: 20150321
* 函数功能: MPU9250 测试主函数
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返回值  : 主程序永不返回
*
* 调用关系: 无
* 其 它   : 无
*
******************************************************************************/
int main(void)
{ 
    unsigned short temp = 0xffff;
    unsigned int now = 0;
    cmos_status_T status = cmos_ERR_E;
    status = cmos_init();
    if(cmos_OK_E != status)
    {
        assert_failed(__FILE__, __LINE__);
    }

    mpu9250_init();

    while(TRUE)
    {
        now = cmos_get_ms();
        cmos_printf("%5.2fs:\r\n",   now / 1000.0);

        mpu9250_read_accel(&s_accel);
        cmos_printf("accel(+-4g):    %5.2f(0x%04x),%5.2f(0x%04x),%5.2f(0x%04x)\r\n",
                s_accel.x/8192.0, s_accel.x, s_accel.y/8192.0, s_accel.y, s_accel.z/8192.0, s_accel.z);

        mpu9250_read_gyro(&s_gyro);
        cmos_printf("gyro(+-2000dps):%5.2f(0x%04x),%5.2f(0x%04x),%5.2f(0x%04x)\r\n",
                s_gyro.x/16.4, s_gyro.x, s_gyro.y/16.4, s_gyro.y, s_gyro.z/16.4, s_gyro.z);

        mpu9250_read_mag(&s_mag);
        cmos_printf("mag(0.15):      %5.2f(0x%04x),%5.2f(0x%04x),%5.2f(0x%04x)\r\n",
                s_mag.x*0.15, s_mag.x, s_mag.y*0.15, s_mag.y, s_mag.z*0.15, s_mag.z);

        mpu9250_read_tem(&temp);
        cmos_printf("temp:           %5.2f(0x%04x)\r\n\r\n", 21 + temp/338.3, temp);

        cmos_delay_ms(1000);
    }
}

