/******************************************************************************
 *
 * 文件名  ： switch.c
 * 负责人  ： 彭鹏(pengpeng@fiberhome.com)
 * 创建日期： 20151117 
 * 版本号  ： v1.1
 * 文件描述： 任务调度模块
 * 版权说明： Copyright (c) 2000-2020 GNU
 * 其    他： 算法说明:
 *            1. 需要一个优先级索引
 *            2. 位图表
 *            3. 每个优先级一个tcb链表
 *
 * 修改日志： 无
 *
 *******************************************************************************/


/*---------------------------------- 预处理区 ---------------------------------*/

/************************************ 头文件 ***********************************/
#include "cmos_config.h"
#include "tcb.h"
#include "switch.h"


/*----------------------------------- 声明区 ----------------------------------*/

/********************************** 变量声明区 *********************************/

/********************************** 函数声明区 *********************************/


/********************************** 变量实现区 *********************************/
static cmos_uint8_T s_priority_index = 0x00;

/********************************** 函数实现区 *********************************/
/*******************************************************************************
 *
 * 函数名  : cmos_task_switch_add
 * 负责人  : 彭鹏
 * 创建日期：20151119 
 * 函数功能: 将任务加入调度器
 *
 * 输入参数: tcb 任务控制块指针
 * 输出参数: 无
 *
 * 返回值  : 执行状态
 *          
 * 调用关系: 无
 * 其 它   : 无
 *
 ******************************************************************************/
cmos_status_T cmos_task_switch_add(const cmos_task_tcb_T *tcb)
{

#if 0
    cmos_priority_T priority = 0;
    cmos_lib_list_node_T *first_tcb = NULL;

    /* step1: 获取该任务优先级*/
    priority = cmos_task_tcb_get_priority(tcb);

    /* step2: 获取该优先级链表 */
    first_tcb = cmos_task_switch_get_first_tcb(priority);

    /* step3: 加入到该优先级链表 */
    if(NULL == head) /* tcb是该优先级头节点 */
    {
        cmos_task_switch_init_first_tcb(tcb); 
        
        /* step4: 更新优先级索引 */
        s_priority_index |=  priority;
    }
    else
    {
        cmos_task_switch_list_add(first_tcb, tcb);
    }

#endif

    return cmos_OK_E;
}

