/********************************************************************************
*
* 文件名  ： config.h
* 负责人  ： 彭鹏(pengpeng@fiberhome.com)
* 创建日期： 20150614
* 版本号  ： v1.0
* 文件描述： 配置
* 版权说明： Copyright (c) 2000-2020 GNU
* 其 他   ： 无
* 修改日志： 无
*
********************************************************************************/
/*---------------------------------- 预处理区 ---------------------------------*/
#ifndef _CONFIG_H_
#define _CONFIG_H_

/************************************ 头文件 ***********************************/
#include "typedef.h"

/************************************ 宏定义 ***********************************/

/************************************ 调度 *************************************/
/****************************** 虚拟文件系统(VFS) ******************************/
/********************************** 控制台配置 *********************************/
/* 调试级别 */
/* 0: 输出err_log */
/* 1: 输出debug_log */
/* 2: 输出trace_log */
#define DEBUG_LEVEL                                         (1)

/* 每秒钟 systick中断数 默认1ms */
#define SLICE_PER_SECONDS                                   (1000)
/* 每秒钟 systick中断数 默认0.1ms */
//#define SLICE_PER_SECONDS                                   (10000)
/* 每ms秒 systick中断数 */
#define SLICE_PER_MSECONDS                                  (SLICE_PER_SECONDS / 1000)

/* printf缓存 */
#define PRINTF_BUF_SIZE                                     (256)

/* console 串口波特率 */
#define CONSOLE_BAUDRATE                                    (115200)

/* imu i2c 速率 */
#define IMU_RATE                                            (100000)

/* 阻塞发送串口数据超时参数 */ 
#define UART_TIMEOUT_DIV                                    (1)

/*--------------------------------- 接口声明区 --------------------------------*/

/*********************************** 全局变量 **********************************/

/*********************************** 接口函数 **********************************/

#endif /* _CONFIG_H_ */

