/********************************************************************************
*
* 文件名  ： imu.h
* 负责人  ： 彭鹏(pengpeng@fiberhome.com)
* 创建日期： 20160112
* 版本号  ： v1.0
* 文件描述： imu(i2c) 驱动头文件
* 版权说明： Copyright (c) 2000-2020 GNU
* 其 他   ： 无
* 修改日志： 无
*
********************************************************************************/
/*---------------------------------- 预处理区 ---------------------------------*/
#ifndef _IMU_H_
#define _IMU_H_

/************************************ 头文件 ***********************************/
#include "config.h"

/************************************ 宏定义 ***********************************/

/*********************************** 类型定义 **********************************/
/*--------------------------------- 接口声明区 --------------------------------*/

/*********************************** 全局变量 **********************************/

/*********************************** 接口函数 **********************************/
void imu_init(void);

void imu_read_poll(uint8_T dev_addr, uint16_T reg_offset, uint8_T *buf, uint32_T n);
void imu_write_poll(uint8_T dev_addr, uint16_T reg_offset, const uint8_T *buf, uint32_T n);

void imu_read(uint8_T dev_addr, uint16_T reg_offset, uint8_T *buf, uint32_T n);
uint32_T imu_read_max(void);

bool_T imu_get_gyro(f32_T *gyro, uint32_T *time);

/* 不使用中断写 */
#if 0
void imu_write(uint8_T dev_addr, uint16_T reg_offset, const uint8_T *buf, uint32_T n);
#endif

#endif

