/******************************************************************************
 *
 * 文件名  ： console.c
 * 负责人  ： 彭鹏(pengpeng@fiberhome.com)
 * 创建日期： 20150614 
 * 版本号  ： 1.0
 * 文件描述： 控制台模块
 * 版权说明： Copyright (c) GNU
 * 其    他： 无
 * 修改日志： 无
 *
 *******************************************************************************/

/*---------------------------------- 预处理区 ---------------------------------*/

/************************************ 头文件 ***********************************/
#include <stdarg.h>
#include <stdio.h>
#include "cmos_config.h"
#include "lib.h"
#include "uart.h"
#include "console.h"

/*----------------------------------- 声明区 ----------------------------------*/

/********************************** 变量声明区 *********************************/
static char s_printf_buf[CMOS_PRINTF_BUF_SIZE] = {0};

/********************************** 函数声明区 *********************************/

/********************************** 函数实现区 *********************************/
/*******************************************************************************
*
* 函数名  : console_init
* 负责人  : 彭鹏
* 创建日期: 20150614
* 函数功能: 控制台初始化
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返回值  : 无
*
* 调用关系: 无
* 其 它   : 无
*
******************************************************************************/
cmos_status_T console_init(cmos_int32_T baud_rate)
{
    cmos_status_T status = cmos_ERR_E;

    status = uart_init(CMOS_CONSOLE_INDEX, baud_rate);
    if(cmos_OK_E != status)
    {
        assert_failed(__FILE__, __LINE__);
    }

    return cmos_OK_E;
}

/*******************************************************************************
*
* 函数名  : console_printf
* 负责人  : 彭鹏
* 创建日期: 20150614
* 函数功能: 控制台打印
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返回值  : 无
*
* 调用关系: 无
* 其 它   : 系统错误或调试打印需要第一时间输出 采用轮询uart方式
*
******************************************************************************/
cmos_int32_T console_printf(char *fmt, ...)
{
    cmos_status_T status = cmos_ERR_E;
    va_list args;
    int n = 0;
   
    va_start(args, fmt);
    n = vsprintf(s_printf_buf, fmt, args);
    va_end(args);

    /* 传输 */
    status = uart_send_poll((cmos_uint8_T *)s_printf_buf, n);
    if(cmos_OK_E != status)
    {
        assert_failed(__FILE__, __LINE__);
    }

    return n;
}

