/******************************************************************************
 *
 * 文件名  ： wait.c
 * 负责人  ： 彭鹏(pengpeng@fiberhome.com)
 * 创建日期： 20150416 
 * 版本号  ： v1.0
 * 文件描述： 实现CMSIS中延迟(Generic Wait Functions)
 * 版权说明： Copyright (c) 2000-2020 GNU
 * 其    他： 无
 * 修改日志： 无
 *
 *******************************************************************************/


/*---------------------------------- 预处理区 ---------------------------------*/

/************************************ 头文件 ***********************************/
#include "typedef.h"
#include "wait.h"
#include "switch.h"
#include "tcb.h"

/*----------------------------------- 声明区 ----------------------------------*/

/********************************** 变量声明区 *********************************/


/********************************** 函数声明区 *********************************/


/********************************** 变量实现区 *********************************/


/********************************** 函数实现区 *********************************/
cm_status_t syscall_delay(cm_uint32_t m_sec)
{
    cm_tcb_t *cur = NULL; 
    
    /* TODO: 判断是否在中断中 */

    /* TODO: 是否需要switch模块记住当前运行的任务？ */
    cur = switch_get_highest_tcb();
    tcb_set_delay(cur, m_sec);

    /* TODO: 需要实现线程的多状态 调度模块更新内部结构切换出delay线程 */
    switch_to_waiting(cur);

    /* 调度 */
    switch_pend();

    return (cm_status_t)0;
}

