/******************************************************************************
 *
 * 文件名  ： syscall.c
 * 负责人  ： 彭鹏(pengpeng@fiberhome.com)
 * 创建日期： 20150410 
 * 版本号  ： v1.0
 * 文件描述： 系统调用实现
 * 版权说明： Copyright (c) 2000-2020 GNU
 * 其    他： 本文件封装所有CMSIS RTOS中需要实现的函数
 *            同时是CMSIS RTOS与CMOS的适配层
 * 修改日志： 无
 *
 *******************************************************************************/
/*---------------------------------- 预处理区 ---------------------------------*/

/************************************ 头文件 ***********************************/
#include <syscall.h>


/*----------------------------------- 声明区 ----------------------------------*/

/********************************** 变量声明区 *********************************/

/********************************** 函数声明区 *********************************/
static void syscall_unimplemented(void);

/********************************** 变量实现区 *********************************/

/********************************** 函数实现区 *********************************/
/*******************************************************************************
 *
 * 函数名  : syscall_c
 * 负责人  : 彭鹏
 * 创建日期：20150409 
 * 函数功能: 系统调用主逻辑
 *
 * 输入参数: sp任务堆栈
 *
 * 输出参数: 无
 *
 * 返回值  : 调用状态
 *          
 * 调用关系: 无
 * 其 它   : 无
 *
 ******************************************************************************/
cm_uint32_t syscall_c(const cm_uint32_t *sp)
{
    cm_uint8_t svc_number = 0;
    svc_number = ((cm_uint8_t *) sp[6])[-2];

    /***************************************************************************
     *
     *  系统调用编号规则:
     *  - 系统调用编号1 Byte.
     *  - 高四位指示系统调用类别(CMSIS共有10类系统调用)
     *  - 低四位指示系统调用类别中的不同调用 
     *  - CMSIS未使用的调用号,用于内核自身扩展
     *    目前已经定义的系统调用号：
     *      0x0 内核信息与控制(Kernel Information and Control)
     *        0x00 osKernelInitialize
     *        0x01 osKernelStart
     *        ...待实现...
     *      0x1 线程管理(Thread Management)
     *        0x10 osThreadCreate
     *        ...待实现...
     *      0x2 普通等待(Generic Wait Functions)
     *        ...待实现...
     *
     **************************************************************************/
    switch(svc_number)
    {
        case 0x00:
            {
                syscall_kernel_initialize();
                break;
            }
        case 0x01:
            {
                syscall_kernel_start();
                break;
            }
        case 0x10:
            {
                syscall_thread_create();
                break;
            }
        default:
            {
                syscall_unimplemented();
                break;
            }
    }

    return 0;
}

void syscall_kernel_initialize(void)
{
    ;
}

void syscall_kernel_start(void)
{
    ;
}

void syscall_thread_create(void)
{
    ;
}

static void syscall_unimplemented(void)
{ 
  while (1)
  {
      ;
  }
}

