/********************************************************************************
*
* 文件名  ： tyepdef_tm.h
* 负责人  ： 彭鹏(pengpeng@fiberhome.com)
* 创建日期： 20150321
* 版本号  ： v1.0
* 文件描述： 线程管理模块类型
* 版权说明： Copyright (c) 2000-2020 GNU
* 其 他   ： 无
* 修改日志： 无
*
********************************************************************************/
/*---------------------------------- 预处理区 ---------------------------------*/
#ifndef _POS_TYPE_DEF_TM_H_
#define _POS_TYPE_DEF_TM_H_

/************************************ 头文件 ***********************************/
#include "typedef.h"

/************************************ 宏定义 ***********************************/

/*********************************** 类型定义 **********************************/
/* 线程上下文 */
typedef struct os_thread_contex_tag {
    /* ISR 硬件入栈 */
    uint32 r0;
    uint32 r1;
    uint32 r2;
    uint32 r3;
    uint32 r12;
    uint32 sp_r13;
    uint32 lr_r14;
    pc_t   pc_r15;
    uint32 xpsr;

    /* ISR 硬件不入栈 */
    uint32 r4_to_r11[8];
}osThreadContex_t;

typedef struct os_thread_cb
{
    os_pthread pthread;
    void       *argv;

    uint32     *psp;
    osPriority priority;
    uint32     stack_size;
}osThreadCb_t;

/*--------------------------------- 接口声明区 --------------------------------*/

/*********************************** 全局变量 **********************************/

/*********************************** 接口函数 **********************************/

#endif // #_POS_TYPE_DEF_TM_H_

