/******************************************************************************
 *
 * 文件名  ： tree.c
 * 负责人  ： 彭鹏(pengpeng@fiberhome.com)
 * 创建日期： 20151030
 * 版本号  ： v1.0
 * 文件描述： 硬件设备树的实现
 * 版权说明： Copyright (c) 2000-2020 GNU
 * 其    他： 无
 *
 * 修改日志： 无
 *
 *******************************************************************************/
/*---------------------------------- 预处理区 ---------------------------------*/

/************************************ 头文件 ***********************************/
#include "cmos_config.h"

/*----------------------------------- 声明区 ----------------------------------*/

/********************************** 变量声明区 *********************************/

/********************************** 函数声明区 *********************************/

/********************************** 变量实现区 *********************************/

/********************************** 函数实现区 *********************************/
/*******************************************************************************
 *
 * 函数名  : cmos_hal_hardware_tree_init
 * 负责人  : 彭鹏
 * 创建日期：20151030 
 * 函数功能: 初始化设备树
 *
 * 输入参数: 无
 *
 * 输出参数: 无
 *
 * 返回值  : 函数执行状态
 *          
 * 调用关系: 无
 * 其 它   : 无
 *
 ******************************************************************************/
cmos_status_T cmos_hal_hardware_tree_init(void)
{
    cmos_status_T status = cmos_ERR_E;

    status = cmos_OK_E;
    return status;
}

/*******************************************************************************
 *
 * 函数名  : cmos_hal_hardware_tree_add
 * 负责人  : 彭鹏
 * 创建日期：20151030 
 * 函数功能: 设备树中加入设备
 *
 * 输入参数: path 设备的路径
 *
 * 输出参数: 无
 *
 * 返回值  : 函数执行状态
 *          
 * 调用关系: 无
 * 其 它   : 无
 *
 ******************************************************************************/
cmos_status_T cmos_hal_hardware_tree_add(const cmos_uint8_T *path)
{
    cmos_status_T status = cmos_ERR_E;

    status = cmos_OK_E;
    return status;
}

/*******************************************************************************
 *
 * 函数名  : cmos_hal_hardware_tree_del
 * 负责人  : 彭鹏
 * 创建日期：20151030 
 * 函数功能: 设备树中删除设备
 *
 * 输入参数: path 设备的路径
 *
 * 输出参数: 无
 *
 * 返回值  : 函数执行状态
 *          
 * 调用关系: 无
 * 其 它   : 无
 *
 ******************************************************************************/
cmos_status_T cmos_hal_hardware_tree_del(const cmos_uint8_T *path)
{
    cmos_status_T status = cmos_ERR_E;

    status = cmos_OK_E;
    return status;
}


