/********************************************************************************
*
* 文件名  ： cmos_api.h
* 负责人  ： 彭鹏(pengpeng@fiberhome.com)
* 创建日期： 20150614
* 版本号  ： v1.0
* 文件描述： cmos api头文件
* 版权说明： Copyright (c) 2000-2020 GNU
* 其 他   ： 无
* 修改日志： 无
*
********************************************************************************/
/*---------------------------------- 预处理区 ---------------------------------*/
#ifndef _CMOS_API_H_
#define _CMOS_API_H_

/************************************ 头文件 ***********************************/
#include "cmos_config.h"
#include "console.h"
#include "hal.h"
#include "lib.h"

/************************************ 宏定义 ***********************************/
/* 控制台输出 */
#define cmos_printf(...)        console_printf(__VA_ARGS__);

/*--------------------------------- 接口声明区 --------------------------------*/

/*********************************** 全局变量 **********************************/

/*********************************** 接口函数 **********************************/
cmos_status_T cmos_init(void);
void cmos_delay_ms(cmos_uint32_T ms);
cmos_uint32_T cmos_get_ms(void);

#endif /* _CMOS_API_H_ */
